# 1. 整数(int) integer 直接写出数字就是整数
a = 10
# 查看变量的数据类型 type()
print(type(a))  # <class 'int'> class类, 类型. 类别

# 能够执行的操作, +  -   *    /    %     //   **
print(1+2)
print(1-2)
print(1 * 2)
print(1/2)
print(10/3)  # 计算机中是无法准确的表示一个小数的
# 1-1000000000  明确的数字的个数的
# 0-1 0.01  0.1 0.001 0.0001 0.0000001  0.99  0.991
# 0.0001 * 100000 => 10 / 100000
print(10 % 3)   # 10/3 = 3......1 # 帮我们求某个数是否是xxx的倍数
print(5 % 2)    # 不能整除
print(99999999999 % 100000000000000)    # ???  9999/10000 = 0....9999
print(10//3)    # 整除. 地板除
# 2048
print(2**0)     # 1
print(2**1)     # 2
print(2**2)     # 4
print(2**3)     # 8
print(2**4)     # 16
print(2**5)     # 32
print(2**6)     # 64
print(2**7)     # 128
print(2**8)     # 256
print(2**9)     # 512
print(2**10)    # 1024


# 字符串(str) string, 用单引号, 双引号, 三引号引起来的内容都是字符串
a = """今天天气不错, 外面一点儿雾霾都没有!"""
print(type(a))  # 查看数据类型  <class 'str'>

a = '床前明月光, \n疑是地\n上霜, \n举头望明月, \n低头思故乡'  # \n 转义字符. 换行
print(a)


# 字符串的相关操作(初步了解)
# + 字符串的连接
# * 数字   字符串重复n次

a = "周杰伦"
b = "昆凌"

print(a + "不喜欢" + b)    # 拼接操作

print(a + 10)  # str和int不能相加
a = "alex"
print(a*20)

# 布尔值(bool) boolean 命题  True真命题, False假命题
# bool值用来做判断的. 没有操作
# alex是一个人  真的
# wusir是一个品德高尚的人  假的

a = 1 > 2
print(a)    # False

b = 33 > 22
print(b)

print(type(a))  # <class 'bool'>
